In [1]:
import pandas as pd
import numpy as np

informatics_categories = ['Programmer', 'System Engineer', 'Telecommunications', 'Cybersecurity', 'Automation']
economic_categories = ['Financial broker', 'Financial advisor', 'Banking', 'Insurer']
healthcare_categories = ['Doctor', 'Nurse']
instruction_categories = ['HeadMaster', 'Teacher']
workers_categories = ['Factory', 'Outdoors']
generic_categories = ['Shop clerk', 'Waiter', 'Delivery', 'Cleaning']
informatics_data = pd.DataFrame()
pdata = pd.read_csv('final_people_data.csv')
for category in informatics_categories:
    informatics_data[category] = np.random.randint(0, 1, 300)
pdata['Working environment'].value_counts()

Generic        2482
Worker         1018
Economic        999
Informatics     959
Instruction     822
healthcare      740
Name: Working environment, dtype: int64

In [23]:
informatics_data
#300 Programmer
#150 System Engineer
#150 Telecommunications
#100 Cybersecurity
#100 Automation
#TOT = 959/800 -> 159 try Generic

,Programmer,System Engineer,Telecommunications,Cybersecurity,Automation
0,0,0,0,0,0
1,0,0,0,0,0
2,0,0,0,0,0
3,0,0,0,0,0
4,0,0,0,0,0
...,...,...,...,...,...
295,0,0,0,0,0
296,0,0,0,0,0
297,0,0,0,0,0
298,0,0,0,0,0
299,0,0,0,0,0

In [24]:
for row in range(len(informatics_data)):
    if 0 <= row < 100:
         informatics_data.loc[row, 'Programmer':'Automation'] = 0
    if 100 <= row < 150:
        informatics_data.at[row, 'System Engineer'] =  informatics_data.at[row, 'Telecommunications'] = 0
    if 150 <= row < 300:
        informatics_data.loc[row, 'System Engineer':'Automation'] = np.NaN


informatics_data

,Programmer,System Engineer,Telecommunications,Cybersecurity,Automation
0,0,0.0,0.0,0.0,0.0
1,0,0.0,0.0,0.0,0.0
2,0,0.0,0.0,0.0,0.0
3,0,0.0,0.0,0.0,0.0
4,0,0.0,0.0,0.0,0.0
...,...,...,...,...,...
295,0,NaN,NaN,NaN,NaN
296,0,NaN,NaN,NaN,NaN
297,0,NaN,NaN,NaN,NaN
298,0,NaN,NaN,NaN,NaN
299,0,NaN,NaN,NaN,NaN

In [25]:
economic_data = pd.DataFrame()

for category in economic_categories:
   economic_data[category] = np.random.randint(0, 1, 539)

economic_data
#financial broker 20
#financial advisor 40
#banking 400
#insurer 539
#TOT = 999/999 -> 0 free place

     Financial broker  Financial advisor  Banking  Insurer
0                   0                  0        0        0
1                   0                  0        0        0
2                   0                  0        0        0
3                   0                  0        0        0
4                   0                  0        0        0
..                ...                ...      ...      ...
534                 0                  0        0        0
535                 0                  0        0        0
536                 0                  0        0        0
537                 0                  0        0        0
538                 0                  0        0        0

[539 rows x 4 columns]

In [26]:
for row in range(len(economic_data)):
    if 20 <= row <= 539:
        economic_data.at[row, 'Financial broker'] = np.NaN
    if 40 <= row <= 539:
        economic_data.at[row, 'Financial advisor'] = np.NaN
    if 400 <= row <= 539:
        economic_data.at[row, 'Banking'] = np.NaN

economic_data

     Financial broker  Financial advisor  Banking  Insurer
0                 0.0                0.0      0.0        0
1                 0.0                0.0      0.0        0
2                 0.0                0.0      0.0        0
3                 0.0                0.0      0.0        0
4                 0.0                0.0      0.0        0
..                ...                ...      ...      ...
534               NaN                NaN      NaN        0
535               NaN                NaN      NaN        0
536               NaN                NaN      NaN        0
537               NaN                NaN      NaN        0
538               NaN                NaN      NaN        0

[539 rows x 4 columns]

In [2]:
healthcare_data = pd.DataFrame()

for category in healthcare_categories:
   healthcare_data[category] = np.random.randint(0, 1, 300)

healthcare_data

#Doctors 50
#Nurse 300
#TOT 740/350 390 -> try Generic

     Doctor  Nurse
0         0      0
1         0      0
2         0      0
3         0      0
4         0      0
..      ...    ...
295       0      0
296       0      0
297       0      0
298       0      0
299       0      0

[300 rows x 2 columns]

In [3]:
for row in range(len(healthcare_data)):
    if 50 <= row <= 300:
        healthcare_data.at[row, 'Doctor'] = np.NaN

healthcare_data

     Doctor  Nurse
0       0.0      0
1       0.0      0
2       0.0      0
3       0.0      0
4       0.0      0
..      ...    ...
295     NaN      0
296     NaN      0
297     NaN      0
298     NaN      0
299     NaN      0

[300 rows x 2 columns]

In [29]:
instruction_data = pd.DataFrame()

for category in instruction_categories:
   instruction_data[category] = np.random.randint(0, 1, 750)

instruction_data

     HeadMaster  Teacher
0             0        0
1             0        0
2             0        0
3             0        0
4             0        0
..          ...      ...
745           0        0
746           0        0
747           0        0
748           0        0
749           0        0

[750 rows x 2 columns]

In [30]:
#HeadMaster 100
#Teacher 750
#TOT 822/850 -> 28 free

for row in range(len(instruction_data)):
    if 100 <= row <= 750:
        instruction_data.at[row, 'HeadMaster'] = np.NaN

instruction_data

     HeadMaster  Teacher
0           0.0        0
1           0.0        0
2           0.0        0
3           0.0        0
4           0.0        0
..          ...      ...
745         NaN        0
746         NaN        0
747         NaN        0
748         NaN        0
749         NaN        0

[750 rows x 2 columns]

In [31]:
workers_data = pd.DataFrame()

for category in workers_categories:
   workers_data[category] = np.random.randint(0, 1, 1018)

workers_data
#All find work as worker

      Factory  Outdoors
0           0         0
1           0         0
2           0         0
3           0         0
4           0         0
...       ...       ...
1013        0         0
1014        0         0
1015        0         0
1016        0         0
1017        0         0

[1018 rows x 2 columns]

In [34]:
generic_data = pd.DataFrame()

for category in generic_categories:
    generic_data[category] = np.random.randint(0, 1, 650)

generic_data

     Shop clerk  Waiter  Delivery  Cleaning
0             0       0         0         0
1             0       0         0         0
2             0       0         0         0
3             0       0         0         0
4             0       0         0         0
..          ...     ...       ...       ...
645           0       0         0         0
646           0       0         0         0
647           0       0         0         0
648           0       0         0         0
649           0       0         0         0

[650 rows x 4 columns]

In [38]:
informatics_data.to_csv(r'informatics_data.csv')
instruction_data.to_csv(r'instruction_data.csv')
economic_data.to_csv(r'economic_data.csv')
healthcare_data.to_csv(r'healthcare_data.csv')
workers_data.to_csv(r'workers_data.csv')
generic_data.to_csv(r'generic_data.csv')